IdeaRS.Connections
ConcreteBlockData.FoundationBlockOffset Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the value of the offset of the foundation block from the base plate. The value is used for the check of the concrete cone failure.
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public NumberGroups FoundationBlockOffset { get; set; }
Property Value
Type: NumberGroups
See Also
Reference
ConcreteBlockData Class
IdeaRS.Connections.Data Namespace